---
kind: method
id: M:Autodesk.Revit.DB.BRepBuilder.#ctor(Autodesk.Revit.DB.BRepType)
source: html/b3eb95b6-2297-44dc-df94-38aed1940b8c.htm
---
# Autodesk.Revit.DB.BRepBuilder.#ctor Method

Construct a BRepBuilder to use in constructing geometry.

## Syntax (C#)
```csharp
public BRepBuilder(
	BRepType geomType
)
```

## Parameters
- **geomType** (`Autodesk.Revit.DB.BRepType`) - Specifies the expected type of the output geometry.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - A value passed for an enumeration argument is not a member of that enumeration